In [30]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [31]:
df.drop(['PassengerId','Name','SibSp','Ticket','Cabin','Embarked'],axis='columns',inplace= True)

In [32]:
df.head()

   Pclass     Sex   Age  Parch     Fare  Survived
0       3    male  22.0      0   7.2500         0
1       1  female  38.0      0  71.2833         1
2       3  female  26.0      0   7.9250         1
3       1  female  35.0      0  53.1000         1
4       3    male  35.0      0   8.0500         0

In [33]:
target= df.Survived
inputs=df.drop(['Survived'],axis='columns')

In [34]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [35]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age  Parch     Fare  female  male
0       3    male  22.0      0   7.2500       0     1
1       1  female  38.0      0  71.2833       1     0
2       3  female  26.0      0   7.9250       1     0
3       1  female  35.0      0  53.1000       1     0
4       3    male  35.0      0   8.0500       0     1

In [36]:
inputs.drop(['Sex'],axis='columns',inplace= True)
inputs.head(6)

   Pclass   Age  Parch     Fare  female  male
0       3  22.0      0   7.2500       0     1
1       1  38.0      0  71.2833       1     0
2       3  26.0      0   7.9250       1     0
3       1  35.0      0  53.1000       1     0
4       3  35.0      0   8.0500       0     1
5       3   NaN      0   8.4583       0     1

In [37]:
#checking is our dataframe have any NA values
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

Age colums have some na values

In [39]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age  Parch     Fare  female  male
0       3  22.000000      0   7.2500       0     1
1       1  38.000000      0  71.2833       1     0
2       3  26.000000      0   7.9250       1     0
3       1  35.000000      0  53.1000       1     0
4       3  35.000000      0   8.0500       0     1
5       3  29.699118      0   8.4583       0     1

In [52]:
from sklearn.model_selection import train_test_split as tts
X_train,X_test,y_train,y_test = tts(inputs,target,test_size = 0.2)

In [53]:
len(X_train)

712

In [54]:
len(X_test)

179

In [55]:
len(inputs)

891

In [56]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [57]:
model.fit(X_train,y_train)

GaussianNB()

In [58]:
model.score(X_test,y_test)

0.8156424581005587

In [59]:
X_test[:10]

     Pclass        Age  Parch      Fare  female  male
253       3  30.000000      0   16.1000       0     1
399       2  28.000000      0   12.6500       1     0
536       1  45.000000      0   26.5500       0     1
277       2  29.699118      0    0.0000       0     1
589       3  29.699118      0    8.0500       0     1
325       1  36.000000      0  135.6333       1     0
471       3  38.000000      0    8.6625       0     1
279       3  35.000000      1   20.2500       1     0
301       3  29.699118      0   23.2500       0     1
878       3  29.699118      0    7.8958       0     1

In [60]:
y_test[:10]

253    0
399    1
536    0
277    0
589    0
325    1
471    0
279    1
301    1
878    0
Name: Survived, dtype: int64

In [64]:
model.predict(X_test)

array([0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0,
       1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0,
       0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1,
       0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 0])

In [65]:
# we can use probablity function to predict the percentage of each class 
'''
Here we have only two classes 
'''
model.predict_proba(X_test[:10])

array([[9.89661786e-01, 1.03382141e-02],
       [4.32333646e-02, 9.56766635e-01],
       [8.96209314e-01, 1.03790686e-01],
       [9.75222455e-01, 2.47775450e-02],
       [9.89611955e-01, 1.03880452e-02],
       [3.86976471e-05, 9.99961302e-01],
       [9.89728350e-01, 1.02716499e-02],
       [7.65146653e-02, 9.23485335e-01],
       [9.89234504e-01, 1.07654959e-02],
       [9.89606613e-01, 1.03933869e-02]])